# BoundaryZRotationSpring Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryZRotationSpring Property
ParameterTypeId Class See Also
---
"Z Rotation - Spring"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryZRotationSpring { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryZRotationSpring As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryZRotationSpring {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace